bidworx-backend/app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "contracts".* FROM "contracts" WHERE "contracts"."client_id" = ?  [["client_id", 7]]
---
    def my_contracts
        @contracts = Client.find(params[:id]).contracts

SELECT "projects".* FROM "projects" WHERE "projects"."client_id" = ? LIMIT ?  [["client_id", 5], ["LIMIT", 1]]
---
    def my_projects
        @projects = Project.where(client_id: params[:id])

INSERT INTO "clients" ("name", "username", "marketplace_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "pete"], ["username", "pGreg"], ["marketplace_id", 6], ["created_at", "2021-03-07 19:37:42.399058"], ["updated_at", "2021-03-07 19:37:42.399058"]]
INSERT INTO "clients" ("name", "username", "marketplace_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "John"], ["username", "jdoe"], ["marketplace_id", 4], ["created_at", "2021-03-10 20:38:54.552804"], ["updated_at", "2021-03-10 20:38:54.552804"]]
SELECT "marketplaces".* FROM "marketplaces" ORDER BY "marketplaces"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def create
        @client = Client.create(client_params)
        puts @client
        Marketplace.first.clients << @client