bidworx-backend/app/controllers/clients_controller.rb

    def create
        @client = Client.create(client_params)
        puts @client
        Marketplace.first.clients << @client
---
SELECT "marketplaces".* FROM "marketplaces" ORDER BY "marketplaces"."id" ASC LIMIT ?  [["LIMIT", 1]]