bidworx-backend/app/controllers/contracts_controller.rb

SELECT "contracts".* FROM "contracts"
---
    def index
        @contracts = Contract.all

INSERT INTO "contracts" ("client_id", "freelancer_id", "project_id", "project_bid_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["client_id", 10], ["freelancer_id", 9], ["project_id", 11], ["project_bid_id", 9], ["created_at", "2021-03-12 16:07:20.983936"], ["updated_at", "2021-03-12 16:07:20.983936"]]
---
    def create
        contract = Contract.create(project_bid_id: params["bid_id"],freelancer_id: params["freelancer_id"], project_id: params["project_id"],client_id: params["client_id"])