bidworx-backend/app/controllers/freelancers_controller.rb

SELECT "freelancers".* FROM "freelancers"
---
    def index
        @freelancers = Freelancer.all

SELECT "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def show
        @freelancer = Freelancer.find(params[:id])