bidworx-backend/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
    def index
        projects = Project.all

INSERT INTO "projects" ("title", "skills", "description", "duration", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "projects".* FROM "projects" ORDER BY "projects"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def create
        p = project_params
        project = Project.create(client_id: p["client_id"].to_i, title: p["title"], skills: p["skills"], duration: p["duration"], description: p["description"])

        if (project.valid?)
            project_data = Project.last