bidworx-backend/app/controllers/sessions_controller.rb

  def login
    is_client = Client.find_by(username: params[:username])
    if is_client
      render json: {type: 'success', message: [login: 'Login successful'] , user_id: is_client.id.to_s}
    else !is_client
      is_freelancer = Freelancer.find_by(username: params[:username])
---
SELECT "clients".* FROM "clients" WHERE "clients"."username" = ? LIMIT ?  [["username", "fsdf"], ["LIMIT", 1]]
SELECT "freelancers".* FROM "freelancers" WHERE "freelancers"."username" = ? LIMIT ?  [["username", "fsdf"], ["LIMIT", 1]]